# Hands-On Pertemuan 9: Spark SQL

## Tujuan:
- Mengasah keterampilan analisis data menggunakan Spark SQL.
- Melakukan lebih banyak latihan SQL yang mengarah ke skenario dunia nyata.
- Mempersiapkan mahasiswa untuk menggunakan Spark SQL dalam proyek besar.

### 1. Refresher: Basic SQL Operations in Spark SQL
- **Tugas 1**: Ulangi pemahaman Anda tentang SQL dasar dengan menjalankan queries sederhana pada dataset di Spark SQL.

In [2]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.10/dist-packages (3.5.3)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)

In [3]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Praktikum Big Data").getOrCreate()

data = [
    ('James', 34, 'M', 3000, 1),
    ('Anna', 28, 'F', 4100, 2),
    ('Lee', 23, 'M', 2700, 1)
]
columns = ['Name', 'Age', 'Gender', 'Salary', 'DeptId']
df = spark.createDataFrame(data, schema=columns)
df.createOrReplaceTempView('employees')
spark.sql('SELECT * FROM employees').show()
spark.sql('SELECT Name, Age FROM employees WHERE Salary > 3000').show()
spark.sql('SELECT AVG(Salary) FROM employees').show()

+-----+---+------+------+------+
| Name|Age|Gender|Salary|DeptId|
+-----+---+------+------+------+
|James| 34|     M|  3000|     1|
| Anna| 28|     F|  4100|     2|
|  Lee| 23|     M|  2700|     1|
+-----+---+------+------+------+

+----+---+
|Name|Age|
+----+---+
|Anna| 28|
+----+---+

+------------------+
|       avg(Salary)|
+------------------+
|3266.6666666666665|
+------------------+

### 2. Advanced Queries for Data Analysis
Gunakan queries lebih kompleks, melibatkan grouping, filtering, dan subqueries.
- **Tugas 2**: Buat SQL query yang menghitung total gaji berdasarkan jenis kelamin dan usia.

In [4]:
spark.sql('''
SELECT Gender, SUM(Salary) as TotalSalary, Age
FROM employees
GROUP BY Gender, Age
ORDER BY Age

''').show()

+------+-----------+---+
|Gender|TotalSalary|Age|
+------+-----------+---+
|     M|       2700| 23|
|     F|       4100| 28|
|     M|       3000| 34|
+------+-----------+---+

- **Tugas Tambahan 2**:
1. Cari rata-rata gaji per departemen.
2. Temukan karyawan yang memiliki gaji di atas rata-rata untuk gender masing-masing.
3. Buat ranking karyawan berdasarkan gaji dalam departemen mereka.

In [5]:
spark.sql("SELECT DeptId, AVG(Salary) AS AvgSalary FROM employees GROUP BY DeptId").show()

+------+---------+
|DeptId|AvgSalary|
+------+---------+
|     1|   2850.0|
|     2|   4100.0|
+------+---------+

In [6]:
spark.sql("""
    SELECT e.*
    FROM employees e
    JOIN (
        SELECT Gender, AVG(Salary) AS AvgSalaryPerGender
        FROM employees
        GROUP BY Gender
    ) g ON e.Gender = g.Gender
    WHERE e.Salary > g.AvgSalaryPerGender
""").show()

+-----+---+------+------+------+
| Name|Age|Gender|Salary|DeptId|
+-----+---+------+------+------+
|James| 34|     M|  3000|     1|
+-----+---+------+------+------+

In [7]:
spark.sql("""
    SELECT *, RANK() OVER (PARTITION BY DeptId ORDER BY Salary DESC) AS SalaryRank
    FROM employees
""").show()

+-----+---+------+------+------+----------+
| Name|Age|Gender|Salary|DeptId|SalaryRank|
+-----+---+------+------+------+----------+
|James| 34|     M|  3000|     1|         1|
|  Lee| 23|     M|  2700|     1|         2|
| Anna| 28|     F|  4100|     2|         1|
+-----+---+------+------+------+----------+

### 3. Penggunaan Window Functions dan Subqueries
Latihan penggunaan window functions untuk menemukan karyawan dengan gaji tertinggi dan urutannya berdasarkan kelompok usia.
- **Tugas 3**: Terapkan window functions untuk menemukan top 3 karyawan dalam kelompok usia tertentu.

In [ ]:
spark.sql('''
SELECT Name, Age, Salary, ROW_NUMBER() OVER (PARTITION BY Age ORDER BY Salary DESC) as rank
FROM employees
''').show()
spark.sql('''
SELECT Name, Age, Salary
FROM (
    SELECT Name, Age, Salary, ROW_NUMBER() OVER (PARTITION BY Age ORDER BY Salary DESC) as rank
    FROM employees
)
WHERE rank <= 3
''').show()

+-----+---+------+----+
| Name|Age|Salary|rank|
+-----+---+------+----+
|  Lee| 23|  2700|   1|
| Anna| 28|  4100|   1|
|James| 34|  3000|   1|
+-----+---+------+----+

+-----+---+------+
| Name|Age|Salary|
+-----+---+------+
|  Lee| 23|  2700|
| Anna| 28|  4100|
|James| 34|  3000|
+-----+---+------+

### 4. Advanced Spark SQL Queries
Menjelajahi queries yang lebih kompleks yang melibatkan multiple joins, subqueries, dan window functions.
- **Tugas 4**: Demonstrasi penggunaan multi-level joins dan subqueries untuk analisis data yang mendalam.

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('Pertemuan9').getOrCreate()

# Data setup for complex SQL queries
employees = spark.createDataFrame([
    ('James', 34, 'M', 3000, 1),
    ('Anna', 28, 'F', 4100, 2),
    ('Lee', 23, 'M', 2700, 1)
], ['Name', 'Age', 'Gender', 'Salary', 'DeptId'])
departments = spark.createDataFrame([
    (1, 'HR'),
    (2, 'Marketing')
], ['DeptId', 'DeptName'])
projects = spark.createDataFrame([
    (1, 'Project A'),
    (2, 'Project B')
], ['DeptId', 'ProjectName'])
employees.createOrReplaceTempView('employees')
departments.createOrReplaceTempView('departments')
projects.createOrReplaceTempView('projects')

# Complex SQL query involving multiple joins and subqueries
spark.sql('''
SELECT e.Name, e.Age, d.DeptName, p.ProjectName
FROM employees e
JOIN departments d ON e.DeptId = d.DeptId
JOIN projects p ON e.DeptId = p.DeptId
''').show()

spark.sql("""
SELECT
    e.Name,
    e.DeptId,
    e.Salary,
    AVG(e.Salary) OVER (PARTITION BY e.DeptId) AS AvgSalary,
    RANK() OVER (PARTITION BY e.DeptId ORDER BY e.Salary DESC) AS SalaryRank
FROM employees e
JOIN departments d ON e.DeptId = d.DeptId
""")

spark.sql("""
SELECT
    e.Name,
    e.Age,
    e.Salary,
    LEAD(e.Salary, 1) OVER (PARTITION BY e.DeptId ORDER BY e.Age) AS NextSalary,
    e.Salary - LEAD(e.Salary, 1) OVER (PARTITION BY e.DeptId ORDER BY e.Age) AS SalaryDiff
FROM employees e
JOIN departments d ON e.DeptId = d.DeptId
""")

Latihan mandiri untuk memperkuat pemahaman tentang Spark SQL dalam analisis data terdistribusi.
- **Tugas 5**: Tuliskan query SQL untuk menemukan rata-rata gaji per departemen dan rangking setiap karyawan dalam departemen berdasarkan gaji.
- **Tugas 6**: Gunakan window functions untuk menentukan tren gaji berdasarkan usia di setiap departemen.

### 5. Advanced Data Analysis and Visualization
Penerapan teknik analisis data yang lebih canggih dan visualisasi menggunakan PySpark dan matplotlib.
- **Tugas 7**: Lakukan analisis tren gaji menggunakan Spark SQL dan visualisasikan hasilnya.

In [ ]:
import matplotlib.pyplot as plt
import pandas as pd

# Advanced data analysis with visualization
salary_trends = spark.sql('''
SELECT Age, AVG(Salary) AS AverageSalary
FROM employees
GROUP BY Age
ORDER BY Age
''').toPandas()

# Visualization of salary trends
plt.figure(figsize=(10, 5))
plt.plot(salary_trends['Age'], salary_trends['AverageSalary'], marker='o')
plt.xlabel('Age')
plt.ylabel('Average Salary')
plt.title('Salary Trends by Age')
plt.grid(True)
plt.show()

### 6. Homework
- **Tugas 1**: Gunakan Spark SQL untuk mencari total gaji dan jumlah karyawan per departemen. Buat visualisasi perbandingan antar departemen.
- **Tugas 2**: Temukan karyawan dengan gaji di atas rata-rata dalam setiap kelompok usia dan visualisasikan data ini dalam bentuk grafik batang atau pie chart.
- **Tugas 3**: Buat dataset yang lebih besar (misalnya, 100+ baris) dan lakukan analisis mendalam menggunakan SQL functions seperti `SUM()`, `AVG()`, `COUNT()`, serta `JOIN` antar tabel serta buat visualisasi yang menarik.

In [1]:
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns

# Asumsikan Anda sudah memiliki SparkSession yang dinamakan 'spark' dan DataFrame 'employees', 'departments', dan 'projects'

# 1. Total gaji dan jumlah karyawan per departemen
total_salary_per_dept = spark.sql("""
SELECT
    DeptId,
    SUM(Salary) as TotalSalary,
    COUNT(*) as NumEmployees
FROM employees
GROUP BY DeptId
""")

# 2. Karyawan dengan gaji di atas rata-rata per kelompok usia
above_avg_salary = spark.sql("""
SELECT
    Age,
    COUNT(*) as NumEmployeesAboveAvg
FROM employees
GROUP BY Age
HAVING AVG(Salary) < Salary
""")

# 3. Rata-rata gaji per proyek dan departemen
avg_salary_per_project = spark.sql("""
SELECT
    p.ProjectName,
    d.DeptName,
    AVG(e.Salary) as AvgSalary
FROM employees e
JOIN departments d ON e.DeptId = d.DeptId
JOIN projects p ON e.DeptId = p.DeptId
GROUP BY p.ProjectName, d.DeptName
""")

# Konversi ke Pandas DataFrame untuk visualisasi
salary_df = total_salary_per_dept.toPandas()
above_avg_salary_df = above_avg_salary.toPandas()
avg_salary_df = avg_salary_per_project.toPandas()

# Visualisasi
# a. Total gaji dan jumlah karyawan per departemen
plt.figure(figsize=(10, 6))
salary_df.plot(x='DeptId', y=['TotalSalary', 'NumEmployees'], kind='bar')
plt.title('Total Gaji dan Jumlah Karyawan per Departemen')
plt.xlabel('Departemen')
plt.ylabel('Jumlah')

# b. Karyawan dengan gaji di atas rata-rata per kelompok usia
plt.figure(figsize=(10, 6))
above_avg_salary_df.plot(kind='bar', x='Age', y='NumEmployeesAboveAvg')
plt.title('Jumlah Karyawan dengan Gaji di Atas Rata-Rata per Usia')
plt.xlabel('Usia')
plt.ylabel('Jumlah Karyawan')

# c. Rata-rata gaji per proyek dan departemen (heatmap)
plt.figure(figsize=(12, 8))
sns.heatmap(avg_salary_df.pivot('DeptName', 'ProjectName', 'AvgSalary'), annot=True, fmt=".2f")
plt.title('Rata-rata Gaji per Proyek dan Departemen')

plt.tight_layout()
plt.show()

NameError: name 'spark' is not defined